load-test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3002
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2024,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /
Document Length:        6627 bytes

Concurrency Level:      500
Time taken for tests:   2.970 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      37470000 bytes
HTML transferred:       33135000 bytes
Requests per second:    1683.52 [#/sec] (mean)
Time per request:       296.996 [ms] (mean)
Time per request:       0.594 [ms] (mean, across all concurrent requests)
Transfer rate:          12320.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5  189  41.5    191     384
Processing:    27   92  28.7     92     207
Waiting:        6   57  21.3     55     181
Total:         44  281  43.7    269     486

Percentage of the requests served within a certain time (ms)
  50%    269
  66%    292
  75%    307
  80%    314
  90%    331
  95%    361
  98%    410
  99%    437
 100%    486 (longest request)